# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2026-04-01 16:31:30 krylon>
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Newsroom [5/14]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: all
  :END:
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2026-04-01 Mi 16:31]
   | Headline                              | Time       |            |       |      |      |
   |---------------------------------------+------------+------------+-------+------+------|
   | *Total time*                          | *1d 13:01* |            |       |      |      |
   |---------------------------------------+------------+------------+-------+------+------|
   | *Newsroom [5/14]*                     | *1d 13:01* |            |       |      |      |
   | \_  /Components [5/14]/               |            | /1d 13:01/ |       |      |      |
   | \_    Model [1/2]                     |            |            |  3:58 |      |      |
   | \_      Strip HTML                    |            |            |       | 1:57 |      |
   | \_      Sanitize HTML                 |            |            |       | 1:26 |      |
   | \_    Database [0/0]                  |            |            |  3:53 |      |      |
   | \_      Tags form a hierarchy         |            |            |       | 0:10 |      |
   | \_    Engine [1/2]                    |            |            |  4:16 |      |      |
   | \_    Cache [0/2]                     |            |            |  2:53 |      |      |
   | \_    Rating Guesser aka Critic [0/1] |            |            |  9:40 |      |      |
   | \_      Testing                       |            |            |       | 2:31 |      |
   | \_    Web [3/7]                       |            |            | 12:21 |      |      |
   | \_      Subscribe to Feeds            |            |            |       | 0:09 |      |
   | \_      Integrate Classifier          |            |            |       | 2:37 |      |
   | \_        Retrain Classifier          |            |            |       |      | 0:54 |
   | \_      Rate Items                    |            |            |       | 5:14 |      |
   #+END:
** Components [5/14]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: all
   :END:
*** Model [1/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-09 Mo 13:15]--[2026-03-09 Mo 13:50] =>  0:35
    :END:
**** TODO Strip HTML
     :LOGBOOK:
     CLOCK: [2026-03-23 Mo 17:44]--[2026-03-23 Mo 18:03] =>  0:19
     CLOCK: [2026-03-23 Mo 14:55]--[2026-03-23 Mo 16:33] =>  1:38
     :END:
     In order to work with the Items in Rating and Tagging, I need to clean
     the up - strip all the HTML at the very least. Remove stopwords, stem the
     rest, etc.
**** DONE Sanitize HTML
     CLOSED: [2026-04-01 Mi 16:31]
     :LOGBOOK:
     CLOCK: [2026-04-01 Mi 15:05]--[2026-04-01 Mi 16:31] =>  1:26
     :END:
     For display in the Web UI, I would like to sanitize the Item Body on the
     server side (ideally caching the result), remove Javascript and such,
     resize images.
*** Database [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-14 Sa 13:24]--[2026-03-14 Sa 13:45] =>  0:21
    CLOCK: [2026-03-10 Di 13:25]--[2026-03-10 Di 13:44] =>  0:19
    CLOCK: [2026-03-10 Di 12:39]--[2026-03-10 Di 13:23] =>  0:44
    CLOCK: [2026-03-10 Di 08:28]--[2026-03-10 Di 09:00] =>  0:32
    CLOCK: [2026-03-09 Mo 15:13]--[2026-03-09 Mo 16:01] =>  0:48
    CLOCK: [2026-03-09 Mo 14:13]--[2026-03-09 Mo 14:55] =>  0:42
    CLOCK: [2026-03-09 Mo 13:50]--[2026-03-09 Mo 14:07] =>  0:17
    :END:
**** Tags form a hierarchy
     :LOGBOOK:
     CLOCK: [2026-04-01 Mi 13:36]--[2026-04-01 Mi 13:46] =>  0:10
     :END:
*** Engine [1/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-12 Do 13:50]--[2026-03-12 Do 14:05] =>  0:15
    CLOCK: [2026-03-12 Do 13:25]--[2026-03-12 Do 13:34] =>  0:09
    CLOCK: [2026-03-11 Mi 13:56]--[2026-03-11 Mi 15:49] =>  1:53
    CLOCK: [2026-03-10 Di 13:51]--[2026-03-10 Di 15:50] =>  1:59
    :END:
**** DONE Parse RSS/Atom
     CLOSED: [2026-03-12 Do 14:15]
     https://github.com/mmcdole/gofeed
**** TODO [#E] Blacklist
     I would like to discard Items based on regular expressions, to filter out
     e.g. paywalled articles.
*** Cache [0/2]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-23 Mo 16:33]--[2026-03-23 Mo 17:42] =>  1:09
    CLOCK: [2026-03-18 Mi 12:50]--[2026-03-18 Mi 14:34] =>  1:44
    :END:
    I am trying to use Go generics so I can use the same code for several
    purposes. But I have very little experience with Go generics, so I expect
    some trouble.
**** TODO Variable TTL
**** TODO Evict expired values
*** Classifier [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
*** Rating Guesser aka Critic [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-30 Mo 18:18]--[2026-03-30 Mo 18:40] =>  0:22
    CLOCK: [2026-03-24 Di 14:57]--[2026-03-24 Di 16:37] =>  1:40
    CLOCK: [2026-03-23 Mo 18:17]--[2026-03-23 Mo 18:28] =>  0:11
    CLOCK: [2026-03-23 Mo 14:53]--[2026-03-23 Mo 14:55] =>  0:02
    CLOCK: [2026-03-22 So 16:37]--[2026-03-22 So 17:17] =>  0:40
    CLOCK: [2026-03-21 Sa 16:27]--[2026-03-21 Sa 16:54] =>  0:27
    CLOCK: [2026-03-19 Do 17:02]--[2026-03-19 Do 18:05] =>  1:03
    CLOCK: [2026-03-19 Do 15:08]--[2026-03-19 Do 15:31] =>  0:23
    CLOCK: [2026-03-18 Mi 12:33]--[2026-03-18 Mi 12:40] =>  0:07
    CLOCK: [2026-03-16 Mo 16:56]--[2026-03-16 Mo 19:10] =>  2:14
    :END:
**** TODO Attempt replacing the RWMutex with a sync.Map
**** Testing
     :LOGBOOK:
     CLOCK: [2026-03-30 Mo 18:45]--[2026-03-30 Mo 21:16] =>  2:31
     :END:
     Testing this is kind of tedious, at best, but I think I better put
     something in place ahead of time. In previous attempts at building an RSS
     reader, this part tended to burn through lots of CPU cycles, and one goal
     in this iteration is to make it more efficient. It should give acceptable
     performance on a Raspberry Pi Model 2, because that is what it is going
     to run on in my humble home.
*** Web [3/7]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
    :LOGBOOK:
    CLOCK: [2026-03-14 Sa 13:50]--[2026-03-14 Sa 14:44] =>  0:54
    CLOCK: [2026-03-14 Sa 12:21]--[2026-03-14 Sa 12:48] =>  0:27
    CLOCK: [2026-03-12 Do 14:50]--[2026-03-12 Do 17:26] =>  2:36
    CLOCK: [2026-03-12 Do 14:16]--[2026-03-12 Do 14:40] =>  0:24
    :END:
**** TODO Subscribe to Feeds
     :LOGBOOK:
     CLOCK: [2026-04-01 Mi 14:02]--[2026-04-01 Mi 14:11] =>  0:09
     :END:
**** TODO Manage Feeds
**** TODO Manage Tags
**** DONE Integrate Classifier
     CLOSED: [2026-03-31 Di 15:25]
     :LOGBOOK:
     CLOCK: [2026-03-31 Di 14:01]--[2026-03-31 Di 15:25] =>  1:24
     CLOCK: [2026-03-31 Di 13:40]--[2026-03-31 Di 13:59] =>  0:19
     :END:
***** DONE Retrain Classifier
      CLOSED: [2026-04-01 Mi 15:05]
      :LOGBOOK:
      CLOCK: [2026-04-01 Mi 14:11]--[2026-04-01 Mi 15:05] =>  0:54
      :END:
**** DONE Rate Items
     CLOSED: [2026-03-31 Di 13:39]
     :LOGBOOK:
     CLOCK: [2026-03-31 Di 13:17]--[2026-03-31 Di 13:39] =>  0:22
     CLOCK: [2026-03-16 Mo 14:21]--[2026-03-16 Mo 15:36] =>  1:15
     CLOCK: [2026-03-16 Mo 14:00]--[2026-03-16 Mo 14:20] =>  0:20
     CLOCK: [2026-03-14 Sa 14:58]--[2026-03-14 Sa 17:50] =>  2:52
     CLOCK: [2026-03-14 Sa 12:59]--[2026-03-14 Sa 13:24] =>  0:25
     :END:
**** TODO [#F] Dark Mode?
     I switched my desktop to a dark theme the other day, after frowning upon
     those for a long time. And I gotta admit, I kind of like it. 
*** Main [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: all
    :END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: all
   :END:
*** Rating
*** Tagging
*** Analysis paralysis
    One thing that just popped up in my mind is that I could attempt to
    analyze the headlines, e.g. the frequency of certain words per day, week
    or month? That could be fun.
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: all
   :END:
